app/controllers/certificates_controller.rb

SELECT "certificates".* FROM "certificates"
---
    def index
        @pending_certificates= Certificate.select { |certificate| certificate.approved == nil && certificate.expiration_date}