app/controllers/shifts_controller.rb

SELECT "shifts".* FROM "shifts"
---
    def index
        @shifts = Shift.select { |shift| shift.shift_time > Time.now }.sort_by!{ |shift| shift.shift_time }

SELECT "shifts".* FROM "shifts"
---
    def archive
        @shifts = Shift.select { |shift| shift.shift_time < Time.now }.sort_by!{ |shift| shift.shift_time }