app/controllers/static_pages_controller.rb

SELECT  "static_contents".* FROM "static_contents" WHERE "static_contents"."sc_key" = $1 LIMIT 1  [["sc_key", "class-open"]]
---
    def class_info
        @openclose = StaticContent.find_by_sc_key('class-open')

SELECT  "users".* FROM "users" WHERE "users"."role" = $1 LIMIT 1  [["role", "executive_director"]]
---
    def staff_info
      @eduser = User.where('role LIKE ?', "executive_director").first

SELECT  "static_contents".* FROM "static_contents" WHERE "static_contents"."sc_key" = $1 LIMIT 1  [["sc_key", "class-open"]]
---
    def itl
        @openclose = StaticContent.find_by_sc_key('class-open')