app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "shifts".* FROM "shifts" INNER JOIN "one_user_shifts" ON "shifts"."id" = "one_user_shifts"."shift_id" WHERE "one_user_shifts"."user_id" = $1  [["user_id", 3]]
---
    def show
        user = current_user
        url_id = request.fullpath.sub('/member_portal/users/', '')
        redirect_to user_page_path(user.id) unless (url_id == current_user.id.to_s)
        @user = User.find_by_id(params[:id])
        @shifts = @user.one_shifts.select { |shift| shift.shift_time > Time.now }.sort_by!{ |shift| shift.shift_time }